import 'package:flutter/foundation.dart';

// Data များကို ထိန်းချုပ်မည့် Notifier
ValueNotifier<List<Map<String, dynamic>>> propertyListNotifier = ValueNotifier([]);
// ValueNotifier<List<Map<String, dynamic>>> propertyListNotifier = ValueNotifier(_initialData);

// စာရင်းအသစ်ထည့်ရန် Function
void addProperty(Map<String, dynamic> property) {
  // အသစ်တင်တဲ့ အိမ်ကို အပေါ်ဆုံးမှာ ပေါ်အောင် ရှေ့ဆုံးကနေ ထည့်ပါမည်
  propertyListNotifier.value = [property, ...propertyListNotifier.value];

}
// User Login ဝင်ထားခြင်း ရှိ/မရှိ မှတ်သားထားမည့် နေရာ
bool isUserLoggedIn = false;

// lib/utils/data_manager.dart (or upload_config.dart)
class PropertyConfig {
  static const List<String> directions = [
    'အရှေ့', 'အနောက်', 'တောင်', 'မြောက်',
    'အရှေ့တောင်', 'အနောက်တောင်', 'အရှေ့မြောက်', 'အနောက်မြောက်'
  ];

  static const List<String> landTypes = [
    'ဂရန်မြေ', 'ဘိုးဘွားပိုင်မြေ', 'ပါမစ်မြေ', 
    'လိုင်စင်မြေ', 'စလစ်မြေ', 'ဂရန်လျှောက်ထားဆဲ', 'ရွာမြေ', 'အခြား'
  ];

  static const Map<String, List<String>> regionData = {
    'ရန်ကုန်တိုင်း': [
      'ကမာရွတ်', 'စမ်းချောင်း', 'လှိုင်', 'ဗဟန်း', 'လမ်းမတော်', 'လသာ', 'ပန်းဘဲတန်း', 'ကျောက်တံတား',
      'အလုံ', 'ကြည့်မြင်တိုင်', 'တောင်ဥက္ကလာ', 'မြောက်ဥက္ကလာ', 'သင်္ဃန်းကျွန်း', 'တာမွေ', 'ရန်ကင်း', 'မရမ်းကုန်း',
      'ဒဂုံ', 'ဒဂုံမြို့သစ်(မြောက်ပိုင်း)', 'ဒဂုံမြို့သစ်(တောင်ပိုင်း)', 'ဒဂုံမြို့သစ်(အရှေ့ပိုင်း)', 'ဒဂုံမြို့သစ်(ဆိပ်ကမ်း)',
      'မင်္ဂလာဒုံ', 'အင်းစိန်', 'ရွှေပြည်သာ', 'လှိုင်သာယာ', 'သကေတ', 'ဒေါပုံ', 'မင်္ဂလာတောင်ညွန့်',
      'လှည်းကူး', 'မှော်ဘီ', 'တိုက်ကြီး', 'ထန်းတပင်', 'ကော့မှူး', 'ကွမ်းခြံကုန်း', 'တွံတေး', 'သန်လျင်', 'ကျောက်တန်း', 'သုံးခွ', 'ခရမ်း', 'ကိုကိုးကျွန်း', 'ဆိပ်ကြီးခနောင်တို'
    ],
    'မန္တလေးတိုင်း': [
      'ချမ်းအေးသာစံ', 'အောင်မြေသာစံ', 'မဟာအောင်မြေ', 'ချမ်းမြသာစည်', 'ပြည်ကြီးတံခွန်', 'အမရပူရ', 'ပုသိမ်ကြီး',
      'ပြင်ဦးလွင်', 'ကျောက်ဆည်', 'မိတ္ထီလာ', 'မြင်းခြံ', 'ညောင်ဦး', 'မိုးကုတ်',
      'သပိတ်ကျင်း', 'စဉ့်ကူး', 'မတ္တရာ', 'တံတားဦး', 'စဉ့်ကိုင်', 'မြစ်သား', 'နွားထိုးကြီး', 'မလှိုင်', 'ဝမ်းတွင်း', 'သာစည်', 'ရမည်းသင်း', 'ပျော်ဘွယ်'
    ],
    'နေပြည်တော်': [
      'ဇမ္ဗူသီရိ', 'ဒက္ခိဏသီရိ', 'ဥတ္တရသီရိ', 'ပုဗ္ဗသီရိ', 'ဇေယျာသီရိ', 'ပျဉ်းမနား', 'လယ်ဝေး', 'တပ်ကုန်း'
    ],
    'ပဲခူးတိုင်း': [
      'ပဲခူး', 'တောင်ငူ', 'ပြည်', 'ရွှေကျင်', 'ညောင်လေးပင်', 'ကျောက်တံခါး', 'ဒိုက်ဦး', 'ဖြူး', 'သနပ်ပင်',
      'ကဝ', 'ဝေါ', 'ကြို့ပင်ကောက်', 'ဇီးကုန်း', 'နတ်တလင်း', 'မုန်းညို', 'လက်ပံတန်း', 'သာယာဝတီ', 'အုတ်ဖို', 'ပန်းတောင်း', 'ပေါက်ခေါင်း', 'သဲကုန်း', 'ရွှေတောင်', 'ရေတာရှည်', 'ကျောက်ကြီး', 'အုတ်တွင်း', 'ထန်းတပင်'
    ],
    'ဧရာဝတီတိုင်း': [
      'ပုသိမ်', 'ဟင်္သာတ', 'မအူပင်', 'မြောင်းမြ', 'ဖျာပုံ', 'လပွတ္တာ', 'ကျုံပျော်', 'ဘိုကလေး', 'ဇလွန်',
      'ဓနုဖြူ', 'ကျိုက်လတ်', 'ဒေးဒရဲ', 'မော်လမြိုင်ကျွန်း', 'ဝါးခယ်မ', 'အိမ်မဲ', 'ပန်းတနော်', 'ညောင်တုန်း', 'မြန်အောင်', 'ကြံခင်း', 'အင်္ဂပူ', 'လေးမျက်နှာ', 'သာပေါင်း', 'ငပုတော', 'ကန်ကြီးထောင့်'
    ],
    'စစ်ကိုင်းတိုင်း': [
      'စစ်ကိုင်း', 'မုံရွာ', 'ရွှေဘို', 'ကလေး', 'ကသာ', 'မော်လိုက်', 'ခန္တီး', 'ယင်းမာပင်', 'ရေဦး',
      'မြင်းမူ', 'မြောင်', 'အရာတော်', 'ဘုတလင်', 'ချောင်းဦး', 'ပုလဲ', 'ဆားလင်းကြီး', 'ကနီ', 'ခင်ဦး', 'ဝက်လက်', 'ကန့်ဘလူ', 'ကျွန်းလှ', 'ထီးချိုင့်', 'ဗန်းမောက်', 'အင်းတော်', 'ဝန်းသို', 'ကောလင်း', 'ပင်လည်ဘူး', 'ကလေးဝ', 'မင်းကင်း', 'တမူး', 'ဟုမ္မလင်း', 'လဟယ်', 'လေရှီး', 'နန်းယွန်း'
    ],
    'မကွေးတိုင်း': [
      'မကွေး', 'မင်းဘူး', 'ပခုက္ကူ', 'သရက်', 'ဂန့်ဂေါ', 'အောင်လံ', 'တောင်တွင်းကြီး',
      'ရေနံချောင်း', 'ချောက်', 'နတ်မောက်', 'မြို့သစ်', 'ပွင့်ဖြူ', 'ငဖဲ', 'စလင်း', 'စေတုတ္တရာ', 'ဆိပ်ဖြူ', 'ရေစကြို', 'ပေါက်', 'မြိုင်', 'ဆော', 'ထီးလင်း', 'ကျောက်ထု', 'မင်းတုန်း', 'ကံမ', 'ဆင်ပေါင်ဝဲ'
    ],
    'တနင်္သာရီတိုင်း': [
      'ထားဝယ်', 'မြိတ်', 'ကော့သောင်း', 'လောင်းလုံး', 'သရက်ချောင်း',
      'ရေဖြူ', 'ကျွန်းစု', 'ပုလော', 'တနင်္သာရီ', 'ဘုတ်ပြင်း'
    ],
    'ကချင်ပြည်နယ်': [
      'မြစ်ကြီးနား', 'ဗန်းမော်', 'ပူတာအို', 'မိုးညှင်း', 'ဖားကန့်', 'ရွှေကူ',
      'ဝိုင်းမော်', 'အင်ဂျန်းယန်', 'တနိုင်း', 'ချီဖွေ', 'ဆော့လော်', 'မိုးမောက်', 'မန်စီ', 'မိုးကောင်း', 'မချမ်းဘော', 'ခေါင်လန်ဖူး', 'ဆွမ်ပရာဘွမ်', 'နောင်မွန်း'
    ],
    'ကယားပြည်နယ်': [
      'လွိုင်ကော်', 'ဒီးမော့ဆို', 'ဖရူဆို', 'ဘောလခဲ',
      'ဖားဆောင်း', 'မယ်စဲ့', 'ရှားတော'
    ],
    'ကရင်ပြည်နယ်': [
      'ဘားအံ', 'မြဝတီ', 'ကော့ကရိတ်', 'ဖာပွန်', 'ကြာအင်းဆိပ်ကြီး',
      'လှိုင်းဘွဲ့', 'သံတောင်ကြီး'
    ],
    'ချင်းပြည်နယ်': [
      'ဟားခါး', 'ဖလမ်း', 'မင်းတပ်', 'မတူပီ', 'တီးတိန်', 'ပလက်ဝ',
      'ထန်တလန်', 'တွန်းဇံ', 'ကန်ပက်လက်'
    ],
    'မွန်ပြည်နယ်': [
      'မော်လမြိုင်', 'သထုံ', 'ကျိုက်ထို', 'ရေး', 'ပေါင်', 'ချောင်းဆုံ', 'မုဒုံ', 'ကျိုက်မရော', 'သံဖြူဇရပ်', 'ဘီးလင်း'
    ],
    'ရခိုင်ပြည်နယ်': [
      'စစ်တွေ', 'မောင်တော', 'ကျောက်ဖြူ', 'သံတွဲ', 'မြောက်ဦး', 'အမ်း', 'ဂွ',
      'ပုဏ္ဏားကျွန်း', 'ပေါက်တော', 'ရသေ့တောင်', 'ဘူးသီးတောင်', 'ကျောက်တော်', 'မင်းပြား', 'မြေပုံ', 'ရမ်းဗြဲ', 'မန်အောင်', 'တောင်ကုတ်'
    ],
    'ရှမ်းပြည်နယ်': [
      'တောင်ကြီး', 'လားရှိုး', 'ကျိုင်းတုံ', 'တာချီလိတ်', 'မူဆယ်', 'ကလော', 'အောင်ပန်း', 'ဟိုပုံး', 'ညောင်ရွှေ', 'ပင်းတယ', 'ရွာငံ',
      'အေးသာယာ', 'သီပေါ', 'ကျောက်မဲ', 'နောင်ချို', 'နမ္မတူ', 'နမ့်ဆန်', 'မန်တုံ', 'မိုးမိတ်', 'မဘိမ်း', 'မိုင်းရယ်', 'တန့်ယန်း', 'ကွမ်းလုံ', 'လောက်ကိုင်', 'ကုန်းကြမ်း', 'မိုင်းတုံ', 'မိုင်းဆတ်', 'မိုင်းပျဉ်း', 'မက်မန်း'
    ],
  };
}